Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71b/atdf/ATSAMV71J19B.atdf
        <register caption="Global Channel Read Write Resume Register" name="XDMAC_GRWR" offset="0x34" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Read Write Resume Bit" mask="0x00000001" name="RWR0"/>
          <bitfield caption="XDMAC Channel 1 Read Write Resume Bit" mask="0x00000002" name="RWR1"/>
          <bitfield caption="XDMAC Channel 2 Read Write Resume Bit" mask="0x00000004" name="RWR2"/>
          <bitfield caption="XDMAC Channel 3 Read Write Resume Bit" mask="0x00000008" name="RWR3"/>
          <bitfield caption="XDMAC Channel 4 Read Write Resume Bit" mask="0x00000010" name="RWR4"/>
          <bitfield caption="XDMAC Channel 5 Read Write Resume Bit" mask="0x00000020" name="RWR5"/>
          <bitfield caption="XDMAC Channel 6 Read Write Resume Bit" mask="0x00000040" name="RWR6"/>
          <bitfield caption="XDMAC Channel 7 Read Write Resume Bit" mask="0x00000080" name="RWR7"/>
          <bitfield caption="XDMAC Channel 8 Read Write Resume Bit" mask="0x00000100" name="RWR8"/>
          <bitfield caption="XDMAC Channel 9 Read Write Resume Bit" mask="0x00000200" name="RWR9"/>
          <bitfield caption="XDMAC Channel 10 Read Write Resume Bit" mask="0x00000400" name="RWR10"/>
          <bitfield caption="XDMAC Channel 11 Read Write Resume Bit" mask="0x00000800" name="RWR11"/>
          <bitfield caption="XDMAC Channel 12 Read Write Resume Bit" mask="0x00001000" name="RWR12"/>
          <bitfield caption="XDMAC Channel 13 Read Write Resume Bit" mask="0x00002000" name="RWR13"/>
          <bitfield caption="XDMAC Channel 14 Read Write Resume Bit" mask="0x00004000" name="RWR14"/>
          <bitfield caption="XDMAC Channel 15 Read Write Resume Bit" mask="0x00008000" name="RWR15"/>
          <bitfield caption="XDMAC Channel 16 Read Write Resume Bit" mask="0x00010000" name="RWR16"/>
          <bitfield caption="XDMAC Channel 17 Read Write Resume Bit" mask="0x00020000" name="RWR17"/>
          <bitfield caption="XDMAC Channel 18 Read Write Resume Bit" mask="0x00040000" name="RWR18"/>
          <bitfield caption="XDMAC Channel 19 Read Write Resume Bit" mask="0x00080000" name="RWR19"/>
          <bitfield caption="XDMAC Channel 20 Read Write Resume Bit" mask="0x00100000" name="RWR20"/>
          <bitfield caption="XDMAC Channel 21 Read Write Resume Bit" mask="0x00200000" name="RWR21"/>
          <bitfield caption="XDMAC Channel 22 Read Write Resume Bit" mask="0x00400000" name="RWR22"/>
          <bitfield caption="XDMAC Channel 23 Read Write Resume Bit" mask="0x00800000" name="RWR23"/>
        </register>
        <register caption="Global Channel Software Request Register" name="XDMAC_GSWR" offset="0x38" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Software Request Bit" mask="0x00000001" name="SWREQ0"/>
          <bitfield caption="XDMAC Channel 1 Software Request Bit" mask="0x00000002" name="SWREQ1"/>
          <bitfield caption="XDMAC Channel 2 Software Request Bit" mask="0x00000004" name="SWREQ2"/>
          <bitfield caption="XDMAC Channel 3 Software Request Bit" mask="0x00000008" name="SWREQ3"/>
          <bitfield caption="XDMAC Channel 4 Software Request Bit" mask="0x00000010" name="SWREQ4"/>
          <bitfield caption="XDMAC Channel 5 Software Request Bit" mask="0x00000020" name="SWREQ5"/>
          <bitfield caption="XDMAC Channel 6 Software Request Bit" mask="0x00000040" name="SWREQ6"/>
          <bitfield caption="XDMAC Channel 7 Software Request Bit" mask="0x00000080" name="SWREQ7"/>
          <bitfield caption="XDMAC Channel 8 Software Request Bit" mask="0x00000100" name="SWREQ8"/>
          <bitfield caption="XDMAC Channel 9 Software Request Bit" mask="0x00000200" name="SWREQ9"/>
          <bitfield caption="XDMAC Channel 10 Software Request Bit" mask="0x00000400" name="SWREQ10"/>
          <bitfield caption="XDMAC Channel 11 Software Request Bit" mask="0x00000800" name="SWREQ11"/>
          <bitfield caption="XDMAC Channel 12 Software Request Bit" mask="0x00001000" name="SWREQ12"/>
          <bitfield caption="XDMAC Channel 13 Software Request Bit" mask="0x00002000" name="SWREQ13"/>
          <bitfield caption="XDMAC Channel 14 Software Request Bit" mask="0x00004000" name="SWREQ14"/>
          <bitfield caption="XDMAC Channel 15 Software Request Bit" mask="0x00008000" name="SWREQ15"/>
          <bitfield caption="XDMAC Channel 16 Software Request Bit" mask="0x00010000" name="SWREQ16"/>
          <bitfield caption="XDMAC Channel 17 Software Request Bit" mask="0x00020000" name="SWREQ17"/>
          <bitfield caption="XDMAC Channel 18 Software Request Bit" mask="0x00040000" name="SWREQ18"/>
          <bitfield caption="XDMAC Channel 19 Software Request Bit" mask="0x00080000" name="SWREQ19"/>
          <bitfield caption="XDMAC Channel 20 Software Request Bit" mask="0x00100000" name="SWREQ20"/>
          <bitfield caption="XDMAC Channel 21 Software Request Bit" mask="0x00200000" name="SWREQ21"/>
          <bitfield caption="XDMAC Channel 22 Software Request Bit" mask="0x00400000" name="SWREQ22"/>
          <bitfield caption="XDMAC Channel 23 Software Request Bit" mask="0x00800000" name="SWREQ23"/>
        </register>
        <register caption="Global Channel Software Request Status Register" name="XDMAC_GSWS" offset="0x3C" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Software Request Status Bit" mask="0x00000001" name="SWRS0"/>
          <bitfield caption="XDMAC Channel 1 Software Request Status Bit" mask="0x00000002" name="SWRS1"/>
          <bitfield caption="XDMAC Channel 2 Software Request Status Bit" mask="0x00000004" name="SWRS2"/>
          <bitfield caption="XDMAC Channel 3 Software Request Status Bit" mask="0x00000008" name="SWRS3"/>
          <bitfield caption="XDMAC Channel 4 Software Request Status Bit" mask="0x00000010" name="SWRS4"/>
          <bitfield caption="XDMAC Channel 5 Software Request Status Bit" mask="0x00000020" name="SWRS5"/>
          <bitfield caption="XDMAC Channel 6 Software Request Status Bit" mask="0x00000040" name="SWRS6"/>
          <bitfield caption="XDMAC Channel 7 Software Request Status Bit" mask="0x00000080" name="SWRS7"/>
          <bitfield caption="XDMAC Channel 8 Software Request Status Bit" mask="0x00000100" name="SWRS8"/>
          <bitfield caption="XDMAC Channel 9 Software Request Status Bit" mask="0x00000200" name="SWRS9"/>
          <bitfield caption="XDMAC Channel 10 Software Request Status Bit" mask="0x00000400" name="SWRS10"/>
          <bitfield caption="XDMAC Channel 11 Software Request Status Bit" mask="0x00000800" name="SWRS11"/>
          <bitfield caption="XDMAC Channel 12 Software Request Status Bit" mask="0x00001000" name="SWRS12"/>
          <bitfield caption="XDMAC Channel 13 Software Request Status Bit" mask="0x00002000" name="SWRS13"/>
          <bitfield caption="XDMAC Channel 14 Software Request Status Bit" mask="0x00004000" name="SWRS14"/>
          <bitfield caption="XDMAC Channel 15 Software Request Status Bit" mask="0x00008000" name="SWRS15"/>
          <bitfield caption="XDMAC Channel 16 Software Request Status Bit" mask="0x00010000" name="SWRS16"/>
          <bitfield caption="XDMAC Channel 17 Software Request Status Bit" mask="0x00020000" name="SWRS17"/>
          <bitfield caption="XDMAC Channel 18 Software Request Status Bit" mask="0x00040000" name="SWRS18"/>
          <bitfield caption="XDMAC Channel 19 Software Request Status Bit" mask="0x00080000" name="SWRS19"/>
          <bitfield caption="XDMAC Channel 20 Software Request Status Bit" mask="0x00100000" name="SWRS20"/>
          <bitfield caption="XDMAC Channel 21 Software Request Status Bit" mask="0x00200000" name="SWRS21"/>
          <bitfield caption="XDMAC Channel 22 Software Request Status Bit" mask="0x00400000" name="SWRS22"/>
          <bitfield caption="XDMAC Channel 23 Software Request Status Bit" mask="0x00800000" name="SWRS23"/>
        </register>
